Rahix/avr-device/vendor/atmega1280.atdf
        <register caption="USART Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR1" offset="0xCC" size="2" mask="0x0FFF"/>
      </register-group>
      <register-group caption="USART" name="USART2">
        <register caption="USART I/O Data Register" name="UDR2" offset="0xD6" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR2A" offset="0xD0" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC2"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC2"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE2"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE2"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR2"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE2"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X2"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM2"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR2B" offset="0xD1" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE2"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE2"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE2"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN2"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN2"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ22"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB82"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB82"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR2C" offset="0xD2" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL2" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM2" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS2" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ2"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL2"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR2" offset="0xD4" size="2" mask="0x0FFF"/>
      </register-group>
      <register-group caption="USART" name="USART3">
        <register caption="USART I/O Data Register" name="UDR3" offset="0x136" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR3A" offset="0x130" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC3"/>
          <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC3"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE3"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE3"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR3"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE3"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X3"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM3"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR3B" offset="0x131" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE3"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE3"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE3"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN3"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN3"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ32"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB83"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB83"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR3C" offset="0x132" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL3" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM3" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS3" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ3"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL3"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR3" offset="0x134" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group caption="" name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="VAL_0x00" value="0x00"/>
        <value caption="Reserved" name="VAL_0x01" value="0x01"/>
        <value caption="Enabled, Even Parity" name="VAL_0x02" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="VAL_0x03" value="0x03"/>
      </value-group>
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
      <value-group caption="" name="COMM_USART_MODE_2BIT">
        <value caption="Asynchronous USART" name="VAL_0x00" value="0x00"/>
        <value caption="Synchronous USART" name="VAL_0x01" value="0x01"/>
        <value caption="Master SPI" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
          <bitfield caption="" mask="0xFE" name="TWAM"/>
        </register>
        <register caption="TWI Bit Rate register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0xBA" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
      <value-group caption="" name="COMM_TWI_PRESACLE">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="4" name="VAL_0x01" value="0x01"/>
        <value caption="16" name="VAL_0x02" value="0x02"/>
        <value caption="64" name="VAL_0x03" value="0x03"/>
      </value-group>
    </module>
